openfoam/swirlingJet-Susan2010-unsteady/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
364800
(
0.0042349
0.00864156
0.0134124
0.0185774
0.0241692
0.0302231
0.0367773
0.043873
...
)
;

boundaryField
{
    shroud1
    {
        type            calculated;
        value           nonuniform List<scalar> 
19200
(
0.758901
0.764068
0.76962
0.775584
0.781983
0.788843
0.796191
0.804053
...
)
;
    }
    stator
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
0.0063341
0.0129251
0.0200607
0.027786
0.0361496
0.0452044
0.0550073
0.0656204
...
)
;
    }
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
0.00420822
0.00858711
0.0133278
0.0184603
0.0240169
0.0300327
0.0365455
0.0435965
...
)
;
    }
}


// ************************************************************************* //
