openfoam/swirlingJet-Susan2010-unsteady/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
364800
(
-1.36869e-19
-0.00441594
-0.00919679
-0.0143727
-0.0199763
-0.026043
-0.0326109
-0.0397216
...
)
;

boundaryField
{
    shroud1
    {
        type            calculated;
        value           nonuniform List<scalar> 
19200
(
-0.753904
-0.748666
-0.742955
-0.736726
-0.729928
-0.722505
-0.714396
-0.705533
...
)
;
    }
    stator
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
0
0.00660488
0.0137555
0.0214971
0.0298783
0.0389522
0.0487758
0.0594112
...
)
;
    }
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
-6.22356e-20
0.00438812
0.00913884
0.0142821
0.0198504
0.0258789
0.0324054
0.0394713
...
)
;
    }
}


// ************************************************************************* //
