openfoam/swirlingJet-Susan2010-unsteady/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
364800
(
0.0449372
0.0449372
0.0449372
0.0449372
0.0449372
0.0449372
0.0449372
0.0449372
...
)
;

boundaryField
{
    shroud1
    {
        type            calculated;
        value           nonuniform List<scalar> 
19200
(
0.0448436
0.0448436
0.0448436
0.0448436
0.0448436
0.0448436
0.0448436
0.0448436
...
)
;
    }
    stator
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
7
7
7
7
7
7
7
7
...
)
;
    }
    rotor
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
