openfoam/swirlingJet-Susan2010-unsteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    rotor
    {
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;
      type            fixedValue;
//        value           uniform (0 0 1);

 value           nonuniform List<vector> 
4560
(
(1.208692521387743639e-19 8.172885040642865334e-03 -1.029480959191308997e-03)
(-8.500934363342449798e-03 1.663547452685924452e-02 3.717820335482624472e-04)
(-1.760553870947242916e-02 2.567537004828912561e-02 3.479278690786569150e-03)
(-2.725574864288426991e-02 3.522936379609695884e-02 8.651260042425834573e-03)
(-3.735096808413737590e-02 4.519075007959129364e-02 1.626096853481640014e-02)
(-4.773745373021548444e-02 5.539975140533184850e-02 2.667229712612056991e-02)
(-5.819812729228065334e-02 6.563349506440416259e-02 4.020281442354306511e-02)
(-6.844655062432911108e-02 7.559999402840961169e-02 5.707526898733072951e-02)
...
(1.620089190586838923e-01 1.609458595883057896e-01 3.070590384664478312e-01)

);
    }

    stator
    {
//	type noSlip;
        type            inletOutlet;
 inletValue      uniform (0 0 0);

    }

    shroud1
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	type slip;
//	type noSlip;
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;

    }



}

// ************************************************************************* //
