openfoam/swirlingJet-Susan2010-unsteady/0/Ubcp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    rotor
    {
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;
      type            fixedValue;
        value           uniform (0 0 1);

// value           nonuniform List<vector> 
//320
//(

//);
    }

    stator
    {
//	type noSlip;
        type            inletOutlet;
 inletValue      uniform (0 0 1);

    }

    shroud1
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	//type slip;
	type noSlip;
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;

    }



}

// ************************************************************************* //
