openfoam/swirlingJet-Susan2010-unsteady/0/a
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
0.00420822
0.00858711
0.0133278
0.0184603
0.0240169
0.0300327
0.0365455
0.0435965
...
0.718387
