openfoam/swirlingJet-Susan2010-unsteady/0/b
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
4560
(
-6.22356e-20
0.00438812
0.00913884
0.0142821
0.0198504
0.0258789
0.0324054
0.0394713
...
-0.723132
