openfoam/swirlingJet-Susan2010-unsteady/0/c
0.00420822	-6.22356e-20
0.00858711	0.00438812
0.0133278	0.00913884
0.0184603	0.0142821
0.0240169	0.0198504
0.0300327	0.0258789
0.0365455	0.0324054
0.0435965	0.0394713
0.0512302	0.0471211
0.0594947	0.0554029
0.068442	0.0643691
0.0781287	0.0740762
0.0886158	0.0845854
0.0999694	0.0959629
0.112261	0.108281
0.125569	0.121616
0.139975	0.136053
0.155573	0.151683
0.172459	0.168605
0.19074	0.186925
0.210532	0.206758
0.231958	0.22823
0.255156	0.251476
0.280269	0.276642
0.307457	0.303888
0.336891	0.333384
0.368757	0.365317
0.403254	0.399887
0.440601	0.437313
0.481033	0.477829
0.00858711	-0.00438812
0.0129468	-5.33314e-20
0.0176667	0.00475072
0.0227767	0.00989402
0.0283089	0.0154623
0.0342982	0.0214907
0.0407825	0.0280173
0.0478026	0.0350832
0.0554028	0.0427329
0.063631	0.0510148
0.072539	0.059981
0.0821832	0.0696881
0.0926243	0.0801973
0.103928	0.0915748
0.116166	0.103892
0.129415	0.117228
0.143759	0.131665
0.159288	0.147295
0.176099	0.164217
0.1943	0.182537
0.214005	0.20237
0.235338	0.223842
0.258433	0.247088
0.283437	0.272254
0.310505	0.2995
0.33981	0.328996
0.371536	0.360928
0.405882	0.395499
0.443065	0.432924
0.483319	0.473441
0.0133278	-0.00913884
0.0176667	-0.00475072
0.0223641	9.14376e-20
0.0274497	0.00514329
0.0329555	0.0107116
0.0389163	0.01674
0.0453696	0.0232666
0.0523562	0.0303325
0.0599201	0.0379822
0.0681091	0.0462641
0.0769746	0.0552303
0.0865728	0.0649374
0.096964	0.0754465
0.108214	0.0868241
0.120393	0.0991417
0.133579	0.112477
0.147854	0.126914
0.163309	0.142545
0.180041	0.159466
0.198155	0.177786
0.217766	0.197619
0.238997	0.219091
0.261982	0.242337
0.286866	0.267503
0.313805	0.294749
0.342971	0.324245
0.374545	0.356178
0.408727	0.390748
0.445733	0.428173
0.485795	0.46869
0.0184603	-0.0142821
0.0227767	-0.00989402
0.0274497	-0.00514329
0.0325089	1.56837e-19
0.0379861	0.0055683
0.043916	0.0115967
0.0503358	0.0181233
0.0572861	0.0251892
0.0648108	0.0328389
0.0729572	0.0411208
...
0.718387	-0.723132
