openfoam/swirlingJet-Susan2010-unsteady/0/out
(
0.00395881
0.00807819
0.012538
0.0173663
0.0225935
0.0282528
0.0343796
0.0410128
0.048194
0.0559687
0.0643858
0.0734984
0.0833639
0.0940447
0.105608
0.118127
0.13168
0.146353
0.162238
0.179436
0.198054
0.218211
0.240034
0.263659
0.289236
0.316925
0.346902
0.379355
0.414489
0.452524
0.00807819
0.0121795
0.0166197
0.0214268
0.0266312
0.0322655
0.0383655
0.0449696
0.0521193
0.0598599
0.06824
0.0773126
0.0871349
0.0977688
0.109281
0.121745
0.135239
0.149847
0.165663
0.182785
0.201322
0.221391
0.243117
0.266639
0.292103
0.319671
0.349517
0.381827
0.416807
0.454675
0.012538
0.0166197
0.0210387
0.0258229
0.0310024
0.0366099
0.0426808
0.0492533
0.056369
0.0640726
0.0724127
0.081442
0.0912174
0.101801
0.113258
0.125663
0.139092
0.153631
0.169371
0.186411
0.20486
0.224833
0.246455
0.269865
0.295208
0.322644
0.352347
0.384504
0.419316
0.457004
0.0173663
0.0214268
0.0258229
0.0305822
0.0357349
0.0413133
0.0473526
0.0538911
0.0609698
...
0.67581
