openfoam/swirlingJet-Susan2010-unsteady/0/script.sh
#postProcess -func writeCellCentres
grep rotor Ccx -A 4565   > a
grep rotor Ccy -A 4565   > b
paste a b > c
tail -n 4560 c > c1
mv c1 c 
python3 script.py
sed 's/^/(/g' vel | sed 's/$/)/' > vel2
cat p1 vel2 p3 > U
#python3 script.py
