openfoam/swirlingJet-Susan2010-unsteady/0/vel2
(1.208692521387743639e-19 8.172885040642865334e-03 -1.029480959191308997e-03)
(-8.500934363342449798e-03 1.663547452685924452e-02 3.717820335482624472e-04)
(-1.760553870947242916e-02 2.567537004828912561e-02 3.479278690786569150e-03)
(-2.725574864288426991e-02 3.522936379609695884e-02 8.651260042425834573e-03)
(-3.735096808413737590e-02 4.519075007959129364e-02 1.626096853481640014e-02)
(-4.773745373021548444e-02 5.539975140533184850e-02 2.667229712612056991e-02)
(-5.819812729228065334e-02 6.563349506440416259e-02 4.020281442354306511e-02)
(-6.844655062432911108e-02 7.559999402840961169e-02 5.707526898733072951e-02)
(-7.812377427534927810e-02 8.493639963585311592e-02 7.735474970439951137e-02)
(-8.680608955386277803e-02 9.321718278610324759e-02 1.008795696871103709e-01)
(-9.402602962466760639e-02 9.997544659738137607e-02 1.271959213464152472e-01)
(-9.930856353813476145e-02 1.047414549896170249e-01 1.555126469093784380e-01)
(-1.022264719009246953e-01 1.070974493077760797e-01 1.846998287424508611e-01)
(-1.024691609224137878e-01 1.067473006330274948e-01 2.133570835351983053e-01)
(-9.991584338309368596e-02 1.035883718660658981e-01 2.399664751766685811e-01)
(-9.469324213051014127e-02 9.777114623968907736e-02 2.631201600203409985e-01)
(-8.720400206942964527e-02 8.971783194540665363e-02 2.817846758412510533e-01)
(-7.809143919961471225e-02 8.009414021743807566e-02 2.955225166521865399e-01)
(-6.816245546549000445e-02 6.972052375150761261e-02 3.045700620424706684e-01)
(-5.826173343354469625e-02 5.945081201077605237e-02 3.097355207108910546e-01)
(-4.915547082361627906e-02 5.005271662251319781e-02 3.121260275058228562e-01)
(-4.145771142393916975e-02 4.213489824507769821e-02 3.128242152417782251e-01)
(-3.561742253680488107e-02 3.613863376545270456e-02 3.126537831988838723e-01)
(-3.195929839382231907e-02 3.237831060192663396e-02 3.121116444016907021e-01)
(-3.073258522545852661e-02 3.109352279676657824e-02 3.114376588975929505e-01)
(-3.214541094112827180e-02 3.248356141076848974e-02 3.107297605837323062e-01)
(-3.636882862515895126e-02 3.671129495021512729e-02 3.100305265878356420e-01)
(-4.352017116287064391e-02 4.388660572139689575e-02 3.093679025231685920e-01)
(-5.364061496298082321e-02 5.404391955716916079e-02 3.087662698134951422e-01)
(-6.667572221500066287e-02 6.712280477796118972e-02 3.082463470663687199e-01)
(8.500934363342449798e-03 1.663547452685924452e-02 3.717820335482624472e-04)
(1.030605457500798287e-19 2.501911207500897086e-02 1.754658734681890930e-03)
(-9.129688118290865337e-03 3.395095081996186287e-02 4.828533527403144898e-03)
(-1.883659927919779931e-02 4.336311941986214363e-02 9.948930712413817101e-03)
(-2.902726343020193070e-02 5.314409225789458457e-02 1.748642213541529156e-02)
(-3.955593421775793067e-02 6.312950918246054699e-02 2.780276825826427656e-02)
(-5.021439509941470758e-02 7.309300211447498918e-02 4.121511176881881289e-02)
(-6.072392498527830890e-02 8.273935947978702798e-02 5.794640631156883215e-02)
(-7.073286950704563147e-02 9.170449519515287695e-02 7.806464816923419647e-02)
(-7.982312817475741007e-02 9.956376323905981318e-02 1.014143322725384599e-01)
(-8.752850767632493201e-02 1.058540274142300980e-01 1.275502090953663792e-01)
(-9.337083383877824161e-02 1.101122560600601707e-01 1.556930381605010627e-01)
(-9.691326165448792274e-02 1.119304891993095352e-01 1.847261849476841133e-01)
(-9.782840808872042548e-02 1.110252033948699590e-01 2.132620207937344081e-01)
(-9.597099967198746695e-02 1.073091975118016517e-01 2.397919495014545210e-01)
(-9.144033264396676797e-02 1.009464517787470594e-01 2.629128252365676710e-01)
(-8.460509220784359630e-02 9.237643603620845911e-02 2.815861012085786874e-01)
(-7.608242290990285817e-02 8.227717831883367416e-02 2.953608361926124415e-01)
(-6.665649948025746674e-02 7.147946255243892155e-02 3.044585607313091136e-01)
(-5.715966111954373652e-02 6.084312854669106374e-02 3.096725487672214450e-01)
(-4.835784780023809348e-02 5.113811937782256761e-02 3.120999455328956618e-01)
(-4.087192996584717436e-02 4.297101640577970227e-02 3.128210056705204023e-01)
(-3.516350525944101496e-02 3.677803112540115743e-02 3.126622577873096609e-01)
(-3.156913190104616851e-02 3.286585335251942380e-02 3.121251649257782423e-01)
(-3.035067095263275713e-02 3.146589343621781359e-02 3.114531459700133342e-01)
(-3.172667890265269686e-02 3.276952533742177182e-02 3.107458574169551513e-01)
(-3.587813181815851377e-02 3.693262252635245990e-02 3.100464647617606206e-01)
(-4.293250450480821934e-02 4.405960771941414000e-02 3.093829807126618481e-01)
(-5.293994823842868708e-02 5.418003660286657003e-02 3.087798793293342614e-01)
(-6.585612800362521113e-02 6.723016792078449766e-02 3.082579550138674906e-01)
(1.760553870947242916e-02 2.567537004828912561e-02 3.479278690786569150e-03)
(9.129688118290865337e-03 3.395095081996186287e-02 4.828533527403144898e-03)
(-1.747567645078811582e-19 4.274256714011200747e-02 7.843493355617514595e-03)
(-9.739116588868144270e-03 5.197759189729801027e-02 1.287500185627116212e-02)
(-2.000249036754360096e-02 6.154001935355905839e-02 2.028920614474111206e-02)
(-3.065337759425007177e-02 7.126141209504861795e-02 3.044418417927807763e-02)
(-4.149340203419536049e-02 8.091165245161004160e-02 4.365446471311107413e-02)
(-5.225365733139826496e-02 9.019378336682284947e-02 6.014320056142041793e-02)
(-6.259152450643835908e-02 9.874336946196472786e-02 7.998149853632616213e-02)
(-7.209586828848112139e-02 1.061381222772514871e-01 1.030214504573790657e-01)
(-8.030392834760720355e-02 1.119197752499212495e-01 1.288297097641285804e-01)
(-8.673555113044686959e-02 1.156335104409161874e-01 1.566438838491221730e-01)
(-9.094483373503203794e-02 1.168824910139455997e-01 1.853670573353144169e-01)
(-9.258712955923029120e-02 1.153968038611692809e-01 2.136331997454861686e-01)
(-9.149218990362086024e-02 1.111037960723553070e-01 2.399497789911935741e-01)
(-8.772563399706238829e-02 1.041839884037945307e-01 2.629244744008013557e-01)
(-8.162232571648320167e-02 9.508948852360582515e-02 2.815183501109107533e-01)
(-7.376480403287410947e-02 8.450984869202453342e-02 2.952697520045373669e-01)
(-6.491075782514907355e-02 7.328582738387910689e-02 3.043798668938658136e-01)
(-5.587876151329863178e-02 6.228080944319400181e-02 3.096217699205722207e-01)
(-4.743085760941566364e-02 5.226637184770700773e-02 3.120769271132142197e-01)
(-4.019494072501442888e-02 4.384694144650521513e-02 3.128177772460143391e-01)
(-3.464503391515858649e-02 3.745352659792387101e-02 3.126701767636799745e-01)
(-3.113220455372069095e-02 3.338568536243571166e-02 3.121383768907454725e-01)
(-2.993163611057801307e-02 3.186676483950728889e-02 3.114686552179457002e-01)
(-3.127425564230174038e-02 3.308042601087408940e-02 3.107622658472863897e-01)
(-3.535247852890745224e-02 3.717549671964479052e-02 3.100629275122096518e-01)
(-4.230426560611950937e-02 4.425075897609818260e-02 3.093987581688413813e-01)
(-5.219097697173378375e-02 5.433140515292139705e-02 3.087942428763290059e-01)
(-6.497850911379993155e-02 6.734992177118870327e-02 3.082703071458463007e-01)
(2.725574864288426991e-02 3.522936379609695884e-02 8.651260042425834573e-03)
(1.883659927919779931e-02 4.336311941986214363e-02 9.948930712413817101e-03)
(9.739116588868144270e-03 5.197759189729801027e-02 1.287500185627116212e-02)
(-2.942697354883801629e-19 6.099571787281191093e-02 1.777349618937501541e-02)
(-1.030470794675610036e-02 7.029715829539930072e-02 2.500377116005003675e-02)
(-2.104864194700386756e-02 7.970993125153033598e-02 3.491816871385583498e-02)
(-3.204467425812076997e-02 8.900113745961914236e-02 4.782701132236016894e-02)
(-4.303552939363496088e-02 9.787280423342986646e-02 6.395248977163114912e-02)
(-5.368962584309198288e-02 1.059617588467173521e-01 8.336936812793566132e-02)
(-6.360505054723311624e-02 1.128491272977324295e-01 1.059384704849672953e-01)
...
(1.620089190586838923e-01 1.609458595883057896e-01 3.070590384664478312e-01)
